witalis3/UA3REO-DDC-Transceiver/STM32/Src/front_unit.c
		#ifdef FRONT_UNIT_DEBUG
		static uint8_t fu_gebug_lastchannel = 255;
		if((HAL_GetTick() - fu_debug_lasttime > 500 && fu_gebug_lastchannel != PERIPH_FrontPanel_Buttons[b].channel) || fu_debug_lasttime == 0)
		{
			sendToDebug_str("F_UNIT: port ");
			sendToDebug_uint8(PERIPH_FrontPanel_Buttons[b].port, true);
			sendToDebug_str(" channel ");
			sendToDebug_uint8(PERIPH_FrontPanel_Buttons[b].channel, true);
			sendToDebug_str(" value ");
			sendToDebug_uint16(mcp3008_value, false);
			fu_gebug_lastchannel = PERIPH_FrontPanel_Buttons[b].channel;
		}
		#endif
		
		// AF_GAIN
		if(PERIPH_FrontPanel_Buttons[b].type == FUNIT_CTRL_AF_GAIN)
		{
			TRX_Volume = (uint16_t)(1023.0f - mcp3008_value);
			if (TRX_Volume < 50)
				TRX_Volume = 0;
		}

		// SHIFT or IF Gain
		if(PERIPH_FrontPanel_Buttons[b].type == FUNIT_CTRL_SHIFT)
		{
			if (TRX.ShiftEnabled)
			{
				int_fast16_t TRX_SHIFT_old = TRX_SHIFT;
				TRX_SHIFT = (int_fast16_t)(((1023.0f - mcp3008_value) * TRX.SHIFT_INTERVAL * 2 / 1023.0f) - TRX.SHIFT_INTERVAL);
				if (TRX_SHIFT_old != TRX_SHIFT)
				{
					TRX_setFrequency(CurrentVFO()->Freq, CurrentVFO());
					uint16_t LCD_bw_trapez_stripe_pos_new = LAYOUT->BW_TRAPEZ_POS_X + LAYOUT->BW_TRAPEZ_WIDTH / 2;
					LCD_bw_trapez_stripe_pos_new = LCD_bw_trapez_stripe_pos_new + (int16_t)((float32_t)(LAYOUT->BW_TRAPEZ_WIDTH * 0.9f) / 2.0f * ((float32_t)TRX_SHIFT / (float32_t)TRX.SHIFT_INTERVAL));
					if (abs(LCD_bw_trapez_stripe_pos_new - LCD_bw_trapez_stripe_pos) > 2)
					{
						LCD_bw_trapez_stripe_pos = LCD_bw_trapez_stripe_pos_new;
						LCD_UpdateQuery.StatusInfoGUI = true;
					}
				}
			}
			else
			{
				TRX_SHIFT = 0;
				TRX.IF_Gain = (uint8_t)(0.0f + ((1023.0f - mcp3008_value) * 60.0f / 1023.0f));
			}
		}
		
		// PTT
		if(PERIPH_FrontPanel_Buttons[b].type == FUNIT_CTRL_PTT)
		{
			static bool frontunit_ptt_state_prev = false;
			bool frontunit_ptt_state_now = false;
			if (mcp3008_value > PERIPH_FrontPanel_Buttons[b].tres_min && mcp3008_value < PERIPH_FrontPanel_Buttons[b].tres_max)
				frontunit_ptt_state_now = true;
			if(frontunit_ptt_state_prev != frontunit_ptt_state_now)
			{
				TRX_ptt_soft = frontunit_ptt_state_now;
				TRX_ptt_change();
				frontunit_ptt_state_prev = frontunit_ptt_state_now;
			}
		}
		
		//BUTTONS
		if(PERIPH_FrontPanel_Buttons[b].type == FUNIT_CTRL_BUTTON)
		{
			//set state
			if (mcp3008_value >= PERIPH_FrontPanel_Buttons[b].tres_min && mcp3008_value < PERIPH_FrontPanel_Buttons[b].tres_max)
			{
				//sendToDebug_uint16(b,false);
				PERIPH_FrontPanel_Buttons[b].state = true;
			}
			else
				PERIPH_FrontPanel_Buttons[b].state = false;

			//check state
			if ((PERIPH_FrontPanel_Buttons[b].prev_state != PERIPH_FrontPanel_Buttons[b].state) && PERIPH_FrontPanel_Buttons[b].state)
			{
				PERIPH_FrontPanel_Buttons[b].start_hold_time = HAL_GetTick();
				PERIPH_FrontPanel_Buttons[b].afterhold = false;
			}

			//check hold state
			if ((PERIPH_FrontPanel_Buttons[b].prev_state == PERIPH_FrontPanel_Buttons[b].state) && PERIPH_FrontPanel_Buttons[b].state && ((HAL_GetTick() - PERIPH_FrontPanel_Buttons[b].start_hold_time) > KEY_HOLD_TIME) && !PERIPH_FrontPanel_Buttons[b].afterhold)
			{
				PERIPH_FrontPanel_Buttons[b].afterhold = true;
				if (!LCD_systemMenuOpened || PERIPH_FrontPanel_Buttons[b].work_in_menu)
				{
					if (!LCD_window.opened)
					{
						if (PERIPH_FrontPanel_Buttons[b].holdHandler != NULL)
						{
							WM8731_Beep();
							PERIPH_FrontPanel_Buttons[b].holdHandler(PERIPH_FrontPanel_Buttons[b].parameter);
						}
					}
					else
					{
						LCD_closeWindow();
					}
				}
			}

			//check click state
			if ((PERIPH_FrontPanel_Buttons[b].prev_state != PERIPH_FrontPanel_Buttons[b].state) && !PERIPH_FrontPanel_Buttons[b].state && ((HAL_GetTick() - PERIPH_FrontPanel_Buttons[b].start_hold_time) < KEY_HOLD_TIME) && !PERIPH_FrontPanel_Buttons[b].afterhold && !TRX.Locked)
			{
				if (!LCD_systemMenuOpened || PERIPH_FrontPanel_Buttons[b].work_in_menu)
				{
					if (!LCD_window.opened)
					{
						if (PERIPH_FrontPanel_Buttons[b].clickHandler != NULL)
						{
							WM8731_Beep();
							PERIPH_FrontPanel_Buttons[b].clickHandler(PERIPH_FrontPanel_Buttons[b].parameter);
						}
					}
					else
					{
						LCD_closeWindow();
					}
				}
			}

			//save prev state
			PERIPH_FrontPanel_Buttons[b].prev_state = PERIPH_FrontPanel_Buttons[b].state;
		}
	}
	
	#ifdef FRONT_UNIT_DEBUG
	if(HAL_GetTick() - fu_debug_lasttime > 500)
	{
		sendToDebug_newline();
		fu_debug_lasttime = HAL_GetTick();
	}
	#endif
	
	SPI_process = false;
}

void FRONTPANEL_BUTTONHANDLER_DOUBLE(uint32_t parameter)
{
	TRX.Dual_RX = !TRX.Dual_RX;
	LCD_UpdateQuery.StatusInfoGUI = true;
	NeedReinitAudioFilters = true;
}

void FRONTPANEL_BUTTONHANDLER_DOUBLEMODE(uint32_t parameter)
{
	if (!TRX.Dual_RX)
		return;

	if (TRX.Dual_RX_Type == VFO_A_AND_B)
		TRX.Dual_RX_Type = VFO_A_PLUS_B;
	else if (TRX.Dual_RX_Type == VFO_A_PLUS_B)
		TRX.Dual_RX_Type = VFO_A_AND_B;
	LCD_UpdateQuery.StatusInfoGUI = true;
	NeedReinitAudioFilters = true;
}

void FRONTPANEL_BUTTONHANDLER_AsB(uint32_t parameter) // A/B
{
	TRX_TemporaryMute();
	TRX.current_vfo = !TRX.current_vfo;
	TRX_setFrequency(CurrentVFO()->Freq, CurrentVFO());
	TRX_setMode(CurrentVFO()->Mode, CurrentVFO());
	LCD_UpdateQuery.TopButtons = true;
	LCD_UpdateQuery.FreqInfo = true;
	LCD_UpdateQuery.StatusInfoGUI = true;
	NeedSaveSettings = true;
	NeedReinitAudioFiltersClean = true;
	NeedReinitAudioFilters = true;
	resetVAD();
	FFT_Init();
	TRX_ScanMode = false;
	LCD_redraw(false);
}

void FRONTPANEL_BUTTONHANDLER_TUNE(uint32_t parameter)
{
	TRX_Tune = !TRX_Tune;
	TRX_ptt_hard = TRX_Tune;
	LCD_UpdateQuery.StatusInfoGUIRedraw = true;
	LCD_UpdateQuery.TopButtons = true;
	NeedSaveSettings = true;
	TRX_Restart_Mode();
}

void FRONTPANEL_BUTTONHANDLER_PRE(uint32_t parameter)
{
	TRX.LNA = !TRX.LNA;
	int8_t band = getBandFromFreq(CurrentVFO()->Freq, true);
	if (band > 0)
	{
		TRX.BANDS_SAVED_SETTINGS[band].LNA = TRX.LNA;
	}
	LCD_UpdateQuery.TopButtons = true;
	NeedSaveSettings = true;
	resetVAD();
}

void FRONTPANEL_BUTTONHANDLER_ATT(uint32_t parameter)
{
	TRX.ATT = !TRX.ATT;

	int8_t band = getBandFromFreq(CurrentVFO()->Freq, true);
	if (band > 0)
	{
		TRX.BANDS_SAVED_SETTINGS[band].ATT = TRX.ATT;
		TRX.BANDS_SAVED_SETTINGS[band].ATT_DB = TRX.ATT_DB;
	}

	LCD_UpdateQuery.TopButtons = true;
	NeedSaveSettings = true;
	resetVAD();
}

void FRONTPANEL_BUTTONHANDLER_ATTHOLD(uint32_t parameter)
{
	TRX.ATT_DB += TRX.ATT_STEP;
	if (TRX.ATT_DB > 31.0f)
		TRX.ATT_DB = TRX.ATT_STEP;

	int8_t band = getBandFromFreq(CurrentVFO()->Freq, true);
	if (band > 0)
	{
		TRX.BANDS_SAVED_SETTINGS[band].ATT = TRX.ATT;
		TRX.BANDS_SAVED_SETTINGS[band].ATT_DB = TRX.ATT_DB;
	}

	LCD_UpdateQuery.TopButtons = true;
	NeedSaveSettings = true;
	resetVAD();
}

void FRONTPANEL_BUTTONHANDLER_ANT(uint32_t parameter)
{
	TRX.ANT = !TRX.ANT;

	int8_t band = getBandFromFreq(CurrentVFO()->Freq, true);
	if (band > 0)
		TRX.BANDS_SAVED_SETTINGS[band].ANT = TRX.ANT;

	LCD_UpdateQuery.StatusInfoGUI = true;
	NeedSaveSettings = true;
}

void FRONTPANEL_BUTTONHANDLER_PGA(uint32_t parameter)
{
	if (!TRX.ADC_Driver && !TRX.ADC_PGA)
	{
		TRX.ADC_Driver = true;
		TRX.ADC_PGA = false;
	}
	else if (TRX.ADC_Driver && !TRX.ADC_PGA)
	{
		TRX.ADC_Driver = true;
		TRX.ADC_PGA = true;
	}
	else if (TRX.ADC_Driver && TRX.ADC_PGA)
	{
		TRX.ADC_Driver = false;
		TRX.ADC_PGA = true;
	}
	else if (!TRX.ADC_Driver && TRX.ADC_PGA)
	{
		TRX.ADC_Driver = false;
		TRX.ADC_PGA = false;
	}
	int8_t band = getBandFromFreq(CurrentVFO()->Freq, true);
	if (band > 0)
	{
		TRX.BANDS_SAVED_SETTINGS[band].ADC_Driver = TRX.ADC_Driver;
		TRX.BANDS_SAVED_SETTINGS[band].ADC_PGA = TRX.ADC_PGA;
	}
	LCD_UpdateQuery.TopButtons = true;
	NeedSaveSettings = true;
	resetVAD();
}

